#+TITLE: night-shift
#+DATE: 2024-08-17T17:52:12+0800
#+LASTMOD: 2024-09-01T11:59:23+0800
#+TYPE: docs
#+DESCRIPTION: Configuring "Night Shift" for macOS. 🌕🌖🌗🌘🌑

#+begin_src bash :results verbatim :exports results :wrap example :dir ../../..
./zig-out/bin/night-shift -h
#+end_src

#+RESULTS:
#+begin_example
 USAGE:
     ./zig-out/bin/night-shift [OPTIONS] [--] <command>

 Available commands by category:
 Manual on/off control:
   status                   View current Night Shift status
   on                       Turn Night Shift on
   off                      Turn Night Shift off
   toggle                   Toggle Night Shift

 Color temperature:
   temp                     View temperature preference
   temp  <0-100>            Set temperature preference

 Schedule:
   schedule                 View current schedule
   schedule sun             Start schedule from sunset to sunrise
   schedule off             Stop the current schedule
   schedule <from> <to>     Start a custom schedule(HH:mm, 24-hour format)

 OPTIONS:
	-v, --version                     Print version
	-h, --help                        Print help information
#+end_example

* Acknowledgment
- https://github.com/smudge/nightlight
